chat-load-test.yml
config:
# Artillery는 target 값을 URL로 해석하기 때문에 URL 형식을 지켜야 합니다
# Socket.IO 클라이언트가 서버에 연결할 때 HTTP/HTTPS 프로토콜을 통해 초기 핸드셰이크를 수행하기 때문입니다.
  target: 'http://3.35.230.97:3000'
  phases:
    - duration: 20
      arrivalRate: 20
      name: "Warm up"
    - duration: 10
      arrivalRate: 60
      name: "High loads"
  engines:
    socketio: {}

scenarios:
  - name: "1:1 Chat Load Test"
    engine: socketio
    flow:
      - emit:
          # channel은 Socket.IO의 이벤트 이름을 말한다.
          # Socket.IO에서는 이러한 이벤트 기반 통신방식을 사용합니다
          # 이 부분은 "register"라는 이름의 이벤트를 서버로 발송(emit)하라는 의미입니다.
          channel: "register"
      - loop:
          - emit:
              channel: "send_message"
              data:
                message: "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat."
        count: 10